# 3.	По введенным пользователем координатам двух точек вывести
# уравнение прямой вида y = kx + b, проходящей через эти точки.

x1 = int(input('Введите x1: '))
y1 = int(input('Введите y1: '))
x2 = int(input('Введите x2: '))
y2 = int(input('Введите y2: '))

k = (y2 - y1) / (x2 - x1)
b = y1 - k * x1

if b < 0:
    print(f'для координат ({x1}:{y1}) & ({x2}:{y2}) "y = kx + b" равно:\n'
          f'y = {k:.2f}x - {b * -1:.2f}')
else:
    print(f'для координат ({x1}:{y1}) & ({x2}:{y2}) "y = kx + b" равно:\n'
          f'y = {k:.2f}x + {b:.2f}')